# MoveNext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..MoveNext Method
PointIterator Class See Also
---
Increments the iterator to the next point in the collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
True if there is another available point in this iterator. False if the iterator has completed all available points.
# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace